# 2week

### 변수이름 설정을 잘못하면 오류난다.

In [ ]:
def = 5
print(def)

SyntaxError: invalid syntax (556240040.py, line 3)

### 하나의 변수에 값 할당

In [1]:
stock_price=85000
stock_price

85000

### 동시에 여러 변수에 값 할당

In [6]:
ss, lg, sk=80000, 140000, 200000
print("ss:",ss)

ss: 80000

### 숫자형과 문자형의 기본사용

In [7]:
# 숫자형과 문자형의 기본 사용
amount = 1000000
amount

1000000

In [10]:
stock_price="85000"
print(stock_price)

85000

### '' 과 "" 를 사용하여 여러 줄에 걸친 문자열을 정희할 수 있다.

In [13]:
string1="사느냐, 죽느냐? 그것이 문제다.\n"
string2='어떤 것이 더 고귀한 것일까?\n'
string3= """Whether 'tis nobler in the mind to suffer
the slings and arrows of outrageous fortune,
가혹한 운명의 돌팔매와 화살을 견디는 것이 더 고귀한 것일까?\n"""
string4='''Or to take arms against a sea of troubles,
And, by opposing, end them?
아니면 고통의 바다에 맞서
무기를 들고 싸워 그 고통을 끝내는 것이 더 고귀한 것일까?'''
print(string1, string2, string3, string4)

사느냐, 죽느냐? 그것이 문제다.
 어떤 것이 더 고귀한 것일까?
 Whether 'tis nobler in the mind to suffer
the slings and arrows of outrageous fortune,
가혹한 운명의 돌팔매와 화살을 견디는 것이 더 고귀한 것일까?
 Or to take arms against a sea of troubles,
And, by opposing, end them?
아니면 고통의 바다에 맞서
무기를 들고 싸워 그 고통을 끝내는 것이 더 고귀한 것일까?

### 데이터형의 확인

In [16]:
stock_price=85000
apple_stock_price=128.5
print(stock_price, type(stock_price))
print(apple_stock_price, type(apple_stock_price))

85000 <class 'int'>
128.5 <class 'float'>

## 4. 숫자형 연산

In [17]:
stock_price=85000
quantity=10
amount= stock_price*quantity
fee_rate= 0.01
total_fee=amount*fee_rate
print(amount, type(amount))
print(total_fee, type(total_fee))

850000 <class 'int'>
8500.0 <class 'float'>

In [18]:
a=1
b=2
c,d,e=3,4,5
print(a+b,a-b,a*b,a/b)
print(c**b,b**0.5)
print(e/b,e//b,e%b) # // : 몫, % : 나머지

3 -1 2 0.5
9 1.4142135623730951
2.5 2 1

## 5. 숫자형 포매팅

In [23]:
c,d =3,4
e=c+d
# {0:d}는 문자열 포맷 코드입니다. 여기서 0은 인덱스를 나타내며, d는 정수 형식으로 출력하라는 의미입니다. 즉, 이 부분은 첫 번째 인자를 정수로 출력하라는 의미입니다.
print("c+d는 e=c+d={0:d}".format(e))

c+d는 e=c+d=7

In [25]:
a=1
b=2
c,d,e=3,4,5
# {0}, {1}, {2}, {3}" 부분은 출력할 문자열을 정의
print("사칙연산 결과: {0},{1},{3},{2}".format(a+b,a-b,a*b,a/b))
# {0:d}는 정수 형식으로 출력하라는 의미이고, {1:.2f}는 소수점 아래 둘째자리까지 표시
print("c의 e 제곱과 b제곱근 결과는: {0:d}, {1:.2f}".format(c**e,b**0.5))

사칙연산 결과: 3,-1,0.5,2
c의 e 제곱과 b제곱근 결과는: 243, 1.41

## 6. 문자열 연산

### 문자열 연결

In [67]:
company_name="Samsung"
price="85,000"
stock_price=company_name + " " + price + " "
print("*"*50)
print(stock_price*3)

**************************************************
Samsung 85,000 Samsung 85,000 Samsung 85,000

### 문자열 인덱싱

In [68]:
variable='hello python'
print(variable)
print(variable[0],variable[-1],variable[1])

hello python
h n e

### 문자열 슬라이싱

In [71]:
single_string='To be, or not to be, taht is the qeustion'
print(len(single_string))
print(single_string[10:13])

41
not

## 7. 문자열 포매팅

### 서식 문자를 이용한 포매팅

In [73]:
quantity=5
"i have %d stocks." %quantity

'i have 5 stocks.'

In [74]:
company_name = "Samsung"
"I have %s stocks." % company_name

'I have Samsung stocks.'

In [75]:
company_name = "Samsung"
quantity=5
"I have %d %s stocks." %(quantity,company_name)

'I have 5 Samsung stocks.'

### format 함수를 이용한 포매팅

In [76]:
stock_price="{0} {1}".format(company_name,price)
stock_price

'Samsung 85,000'

In [78]:
stock_price="{0} {price}".format(company_name,price=50000)
stock_price

'Samsung 50000'

### f 문자열 포매팅

In [80]:
company_name="Samsung"
price="85,000"
stock_price=f"{company_name} {price}"
stock_price

'Samsung 85,000'

In [88]:
new_price="100,000"
stock_price=f"""{company_name}
{price}
{new_price}
"""
print(stock_price)
stock_price

Samsung
85,000
100,000

'Samsung\n85,000\n100,000\n'

## 8. 문자열 내장 함수

### 문자 개수 세기: count 함수

In [92]:
single_string="To be, or not to be, that is the question"
single_string.count("t")

6

### 문자 위치 찾기: find 함수

In [90]:
single_string.find('t')

12

### 첫 글자만 대문자로 바꾸기: capitalize 함수

In [93]:
single_string="to be, or not to be, that is the question"
text = single_string
text.capitalize()

'To be, or not to be, that is the question'

### 모든 문자를 대문자/소문자로 바꾸기: upper 함수, lower 함수

In [94]:
text.upper()

'TO BE, OR NOT TO BE, THAT IS THE QUESTION'

### 특정 문자 바꾸기: replace 함수

In [97]:
text.replace("question","QEUSTION")

'to be, or not to be, that is the QEUSTION'

### 단어 단위로 쪼개기: split 함수

In [100]:
text.split()

['to', 'be,', 'or', 'not', 'to', 'be,', 'that', 'is', 'the', 'question']

### 문자열의 시작과 끝에서 주어진 문자 삭제하기: strip 함수

In [101]:
'http://www.Python.org'.strip('http://')

'www.Python.org'

In [114]:
'Welcom to Hanbit.co.kr'.strip( )

'Welcom to Hanbit.co.kr'

## 연습문제

H n e

'I have Samsung stocks.'

'To be, or not to be, that is the QUESTION'

# 4week

## 복합 데이터형

    여러 자료를 한 번에 저장 가능
    변수에 저장한 자료를 어떻게 사용할 것인지에 따라 사용

(리스트, 튜플, 집합, 딕셔너리 구분하자)_2주차_데이터타입.pdf_3page

슬라이싱이란?_2주차_데이터타입.pdf_6page

## 리스트 타입

    다양한 값을 연속적으로 저장 가능
    변수 하나에 원소 여러 개 저장 가능
    원소 변경 가능
    정수형, 실수형, 문자형, 숫자형을 저장할 수 있고, 리스트 하나에 문자, 숫자, 실수형 자료를 모두 저장 가능
    + 연산자 사용하여 두 리스트 결합 가능
    리스트 내부의 값 변경 가능

In [115]:
var1 = [10,20,30]

var1

[10, 20, 30]

In [118]:
var1[0] = 50
var1

[50, 20, 30]

In [127]:
# 슬라이싱 : 범위를 지정할 수 있다.
var1 = [100,200,300]
# 처음부터 2개만 출력
var1[:2]

[100, 200]

In [128]:
# 2번째부터 마지막까지
var1[1:]

[200, 300]

In [130]:
var1 = 'nice sonny'
# sonny만 출력
var1[5:]

'sonny'

In [135]:
# 리스트 타입 원소 확인 (in)
1 in [1,2,3,4,5]

True

In [136]:
# 리스트 타입 내 내장 함수 (len_어엄청 많이 사용한다.)
var1 = [10,20,30,40,50]

# var 1 리스트 내에 data가 몇개 있어요? _ 전처리 할 때, 굉장히 많이 사용
len(var1)

5

In [138]:
# 데이터 추가 (append)

var1.append(20)
var1

[10, 20, 30, 40, 50, 100, 20]

In [142]:
# 데이터 정렬
var1.sort()
var1

# 지금까지 [리스트 타입]의 활용을 알아보았다. '전처리' 하는 것에서 중요.

[10, 20, 20, 30, 40, 50, 100]

## 딕셔너리 타입

    {key1:value1, key2:value2, ...} 형태로 원소를 직접 추가
    키는 변경할 수 없어야 하고, 고유값으로 표현할 수 있어야 함
    다양한 데이터형을 키로 사용 가능(튜플이나 문자형 등)
    
    모든 값 출력하기 : key 함수
    모든 값 출력하기 : value 함수

In [143]:
dict = {}

dict

{}

In [144]:
player = {'name': 'sonny', 'age':32, 'no': 7}
player

{'name': 'sonny', 'age': 32, 'no': 7}

In [145]:
# 키 값 추가
player['team']='tot'
player

{'name': 'sonny', 'age': 32, 'no': 7, 'team': 'tot'}

In [146]:
# 특정 키 값 데이터만 출력
player['no']

7

In [147]:
# dict 타입에서 키 값만 출력
player.keys()

dict_keys(['name', 'age', 'no', 'team'])

In [149]:
# dict 타입에서 데이터만 출력
player.values()

dict_values(['sonny', 32, 7, 'tot'])

In [150]:
# 리스트 타입으로 변환 list()
list(player.values())
# 굳이 리스트 타입으로 바꾸는 이유? -> '전처리, 연산' 하기위한 해내들링이 쉬워지기 때문

['sonny', 32, 7, 'tot']

## 튜플

    소괄호를 사용하여정의_()
    기호 없이 사용 가능하지만, 쉼표로 값 구분
    읽기만 가능
    변경 불가하여 불변객체 라고 함
    삭제나 변경 불가능하지만 리스트처럼 인덱싱과 슬라이싱 가능

## 조건문_if
    if~elif~else
    반드시 '들여쓰기(indent) 해줘야 함

## 반복문_for, while
    for x in range(시작값, 종료값+1, 증가값):
        # 이 부분의 처리의 처리문을 반복 실행

## 함수_def
    def__ labda, sorted

In [152]:
for x in range(0,10,4):
    print(x,'는 4의 배수로 10보다 작다')

0 는 4의 배수로 10보다 작다
4 는 4의 배수로 10보다 작다
8 는 4의 배수로 10보다 작다

In [155]:
for x in range(0,10):
    print('nice sonny')

nice sonny
nice sonny
nice sonny
nice sonny
nice sonny
nice sonny
nice sonny
nice sonny
nice sonny
nice sonny

In [156]:
for x in range(0,10):
    print(x)

0
1
2
3
4
5
6
7
8
9

In [159]:
 # range는 리스트 타입의 데이터를 생성해준다.
for x in range(0,10,2):
    print(x)

# for x in range[0,2,4,6,8]:
    # print(x)
# 와 같은 코드

0
2
4
6
8

In [160]:
# range 함수를 사용하여 4의 배수 출력(0~10)
for x in range(0,10,4):
    print(x)

0
4
8

# 5week

## while
- while 문은 반복 횟수가 정해져 있지 않을 때 사용하는 반복문
- 조건을 만족히자 않으면 무조건 반복 수행함
- 조건이 while True:인 경우 항상 참이 되므로 무한 반복하게 됨. 이경우 강제 종료
- break 문을 사용해 반복문을 빠져나올 수 있도록 함
#####
- while 문의 조건이 만족하는 동안은 while 이하의 명령 반복 실행
- 들여쓰기 주의

In [161]:
# while
i = 0

while i <= 10:
    print(i)
    i += 1

0
1
2
3
4
5
6
7
8
9
10

In [162]:
for i in range(0,10,4):
    if i == 4:
        continue
    print('sonny')
    # break와 continue 문제 나오면 맞출 줄 알아야한다.

sonny
sonny

In [164]:
# for in [] 이용해서 0~10까지 출력 (print)
for x in range(0,11):
    print(x)

0
1
2
3
4
5
6
7
8
9
10

In [166]:
# 2단 출력
for x in range(1,10):
    print('2 *',x, '=',2*x)

2 * 1 = 2
2 * 2 = 4
2 * 3 = 6
2 * 4 = 8
2 * 5 = 10
2 * 6 = 12
2 * 7 = 14
2 * 8 = 16
2 * 9 = 18

In [171]:
# 구구단 만들기
for x in range(2,10):
    for y in range(1,10):
        print(x,'*',y,'=',x*y)
        if y == 9 :
            print()

2 * 1 = 2
2 * 2 = 4
2 * 3 = 6
2 * 4 = 8
2 * 5 = 10
2 * 6 = 12
2 * 7 = 14
2 * 8 = 16
2 * 9 = 18

3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27

4 * 1 = 4
4 * 2 = 8
4 * 3 = 12
4 * 4 = 16
4 * 5 = 20
4 * 6 = 24
4 * 7 = 28
4 * 8 = 32
4 * 9 = 36

5 * 1 = 5
5 * 2 = 10
5 * 3 = 15
5 * 4 = 20
5 * 5 = 25
5 * 6 = 30
5 * 7 = 35
5 * 8 = 40
5 * 9 = 45

6 * 1 = 6
6 * 2 = 12
6 * 3 = 18
6 * 4 = 24
6 * 5 = 30
6 * 6 = 36
6 * 7 = 42
6 * 8 = 48
6 * 9 = 54

7 * 1 = 7
7 * 2 = 14
7 * 3 = 21
7 * 4 = 28
7 * 5 = 35
7 * 6 = 42
7 * 7 = 49
7 * 8 = 56
7 * 9 = 63

8 * 1 = 8
8 * 2 = 16
8 * 3 = 24
8 * 4 = 32
8 * 5 = 40
8 * 6 = 48
8 * 7 = 56
8 * 8 = 64
8 * 9 = 72

9 * 1 = 9
9 * 2 = 18
9 * 3 = 27
9 * 4 = 36
9 * 5 = 45
9 * 6 = 54
9 * 7 = 63
9 * 8 = 72
9 * 9 = 81

## function

### 개념
    어떤 작업을 하기 위해 미리 지정된 명령문
    
    동일하게 반복해야 하는 작업을 함수로 만들어 사용하면 편리함

    파이썬에서 제공하는 내장 함수를 사용하거나 또는 사용자가 정의해서 사용 가능

### 형태
    def 예약어 사용

    함수명 다음에는 반드시 괄호와 콜론이 필요

    괄호안 인자값을 쉼표로 구분하여 입력

    def(인자, 인자):
        return 반환값

In [172]:
def u_sum(a,b,c) :
    var_sum = a+b+c
    return var_sum

i=10
j=20
k=i*j

var = u_sum(i,j,k)
print(var)

# 엄청나게 중요하다. 엄청나게 중요하다. 함수의 정의는 많이 사용되기 때문.

230

In [173]:
# 두개의 변수를 10, 20 받아서 합계를 구하고 화면에 출력
# 두개의 변수를 10씩 증가하여 합계를 구하고 화면에 출력
# 두개의 변수를 20씩 증가하여 합계를 구하고 화면에 출력
# ...
# 두개의 변수를 50씩 증가하여 합계를 구하고 화면에 출력

a=10
b=20
c=a+b
print(c)

a=a+10
b=b+10
c=a+b
print(c)

# 이런식으로 직접 작성하여 출력할 수 있지만
# 반복문을 사용하면 더욱 짮게 코드 작성 가능

30
50

In [174]:
def add(a,b):
    c=a+b
    return c

var1 = 10
var2 = 20

for i in range(0,6):
    result = add(var1 + i*10, var2 + i*10)
    print(result)

30
50
70
90
110
130

## pandas
- 데이터를 조작하고 분석하는 데 사용하는 파이선 라이브러리
- 데이터를 표(테이블) 형태로 분석할 수 있음
- 시리즈와 데이터 프레임이라는 두가지 데이터형 사용
- 시리즈는 표의 열, 데이터프레임은 행과 열이 있음

### 시리즈
- 1차원 데이터
- 리스트와 유사하나 리스트와 달리 인덱스를 부여할 수 있음
- sr 별칭을 많이 사용

### 데이터프레임
- 2차원 데이터
- 각각 인덱스를 가진 행(인덱스로 구분)과 열(열 이름으로 구분)로 이루어진 표 형태로 저장
- df 별칭을 많이 사용

In [175]:
# 판다스 사용하기
import pandas as pd
# 시리즈 사용
sr = pd.Series([1,2,3,4,5])
sr

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [176]:
# 데이터프레임 사용
df = pd.DataFrame([1,2,3,4,5])
df

   0
0  1
1  2
2  3
3  4
4  5

In [177]:
# 열 추가하기
df['player'] = ['sonny','lee','kim','hwang','park']
df

   0 player
0  1  sonny
1  2    lee
2  3    kim
3  4  hwang
4  5   park

In [178]:
# 시리즈와 데이터 프레임 생성

# '딕셔너리'로 데이터프레임 생성
dict1 = {'이름':{0:'한빛',1:'한결',2:'한라'},
         '성별':{0:'남자',1:'남자',2:'여자'},
         '나이':{0:'20',1:'21',2:'20'},
         '키':{0:'180',1:'177',2:'160'},}
pd.DataFrame(dict1)

   이름  성별  나이    키
0  한빛  남자  20  180
1  한결  남자  21  177
2  한라  여자  20  160

In [180]:
# '배열'로 데이터프레임 생성
import numpy as np

# 배열
arr1 = np.array([['한빛','남자','20','180'],
                 ['한결','남자','21','177'],
                 ['한라','여자','20','160'],])
# 열 이름 리스트
col_names = ['이름','성별','나이','키']

# 데이터프레임 생성하기
pd.DataFrame(arr1,columns=col_names)

   이름  성별  나이    키
0  한빛  남자  20  180
1  한결  남자  21  177
2  한라  여자  20  160

In [181]:
# csv 파일로 테이터프레임 생성

list1 = list([['허준호','남자','24','183'],
              ['이가원','여자','23','162'],
              ['배규민','남자','21','179'],
              ['고고림','남자','28','182'],
              ['이새봄','여자','26','160'],
              ['이루리','여자','24','163'],
              ['오다현','여자','24','157']])
col_names = ['이름','성별','나이','키']
df = pd.DataFrame(list1, columns=col_names)
df

    이름  성별  나이    키
0  허준호  남자  24  183
1  이가원  여자  23  162
2  배규민  남자  21  179
3  고고림  남자  28  182
4  이새봄  여자  26  160
5  이루리  여자  24  163
6  오다현  여자  24  157

In [182]:
# 데이터프레임을 csv 파일로 저장

# 디렉토리에 csv 파일로 저장하기
df.to_csv('./file.csv',header=True,index=False,encoding='utf-8')
# csv 파일 읽기
df2 = pd.read_csv('./file.csv',sep=',')
df2

    이름  성별  나이    키
0  허준호  남자  24  183
1  이가원  여자  23  162
2  배규민  남자  21  179
3  고고림  남자  28  182
4  이새봄  여자  26  160
5  이루리  여자  24  163
6  오다현  여자  24  157

In [185]:
# 열 이름 조회

df.columns

Index(['이름', '성별', '나이', '키'], dtype='object')

In [186]:
# 데이터프레임 값 개수와 빈도수 확인
df.describe()

         이름  성별  나이    키
count     7   7   7    7
unique    7   2   5    7
top     허준호  여자  24  183
freq      1   4   3    1

In [187]:
# 데이터프레임의 처음 세 행 검색
df.head(3)

    이름  성별  나이    키
0  허준호  남자  24  183
1  이가원  여자  23  162
2  배규민  남자  21  179

In [188]:
# 데이터프레임의 마지막 다섯 행 검색
df.tail(5)

    이름  성별  나이    키
2  배규민  남자  21  179
3  고고림  남자  28  182
4  이새봄  여자  26  160
5  이루리  여자  24  163
6  오다현  여자  24  157

##### 행 정렬

In [189]:
# 인덱스나 특정 열의 값을 기준으로 행을 정렬할 수 있음.
# 기본 정렬 방향은 오름차순이며 내림차순 정렬은 ascending 인자를 False로 지정.

# 인덱스 기준으로 정렬
df.sort_index(axis=0).head()

    이름  성별  나이    키
0  허준호  남자  24  183
1  이가원  여자  23  162
2  배규민  남자  21  179
3  고고림  남자  28  182
4  이새봄  여자  26  160

In [192]:
### sort_values() 함수를 이용하여 특정 열을 기준으로 정렬.

# 열 기준으로 정렬

# 나이 열과 키 열을 기준으로 행을 정렬하기
df.sort_values(by=['나이','키'],ascending=False).head(10)

    이름  성별  나이    키
3  고고림  남자  28  182
4  이새봄  여자  26  160
0  허준호  남자  24  183
5  이루리  여자  24  163
6  오다현  여자  24  157
1  이가원  여자  23  162
2  배규민  남자  21  179

##### 데이터 조회

In [193]:
# 데이터프레임[조건식] _ 시리즈로 출력하기
# 데이터프레임[[조건식]] _ 데이터프레임으로 출력하기

# 열 이름으로 데이터 조회
df[['이름','키']].head()

    이름    키
0  허준호  183
1  이가원  162
2  배규민  179
3  고고림  182
4  이새봄  160

In [194]:
# 인덱스로 데이터 조회
df.iloc[1:4,0:3]   # 두 번째 행부터 네 번째 행의 첫 번째 열부터 세 번째 열을 조회

    이름  성별  나이
1  이가원  여자  23
2  배규민  남자  21
3  고고림  남자  28

In [ ]:
# 조건식을 만족하는 데이터 조회(2)


# 키 열의 데이터를 숫자형으로 입력하면 조건식으로 데이터를 조회할 수 있음.

    이름  성별  나이    키
0  허준호  남자  24  183
3  고고림  남자  28  182

In [ ]:
# 리스트 요소와 일치하는 데이터 조회
    # 나이가 21세 또는 23세인 사람을 조회

    이름  성별  나이    키
1  이가원  여자  23  162
2  배규민  남자  21  179

In [ ]:
# 두 조건식을 동시에 만족하는 데이터 조회

    이름  성별  나이    키
1  이가원  여자  23  162
5  이루리  여자  24  163

In [ ]:
# 두 조건식 중 하나 이상 만족하는 데이터 조회

    이름  성별  나이    키
0  허준호  남자  24  183
2  배규민  남자  21  179
3  고고림  남자  28  182

In [ ]:
# 특정 문자열을 포함하는 문자열 데이터 조회
   # 이름에 '봄' 들어간 사람을 조회

    이름  성별  나이    키
4  이새봄  여자  26  160

##### 데이터프레임 통계

In [ ]:
# 데이터프레임 통계 확인

              나이           키
count   7.000000    7.000000
mean   24.285714  169.428571
std     2.214670   11.355720
min    21.000000  157.000000
25%    23.500000  161.000000
50%    24.000000  163.000000
75%    25.000000  180.500000
max    28.000000  183.000000

##### 데이터 갱신

In [ ]:
# 인덱스로 조회한 데이터를 수정

# 인덱스 4번 행의 키 열 값을 5만큼 증가 시킨다.

    이름  성별  나이    키
4  이새봄  여자  26  165

In [ ]:
# 반복 연산자 사용

# 인덱스 1번 행부터 3번 행까지 키 데이터를 '모름'으로 한꺼번에 변경.

C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_6628\662328567.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '['모름', '모름', '모름']' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[1:3,'키'] = ['모름'] * 3

    이름  성별  나이    키
0  허준호  남자  24  183
1  이가원  여자  23   모름
2  배규민  남자  21   모름
3  고고림  남자  28   모름
4  이새봄  여자  26  165
5  이루리  여자  24  163
6  오다현  여자  24  157

##### 데이터프레임 구조 수정

In [ ]:
# 인덱스 변경(1)

# inplace=True 를 지정하면 직업을 데이터프레임 원본에 적용.

     성별  나이    키
이름
허준호  남자  24  183
이가원  여자  23   모름
배규민  남자  21   모름

In [ ]:
# 열 생성

     성별  나이    키     보너스
이름
허준호  남자  24  183  240000
이가원  여자  23   모름  230000
배규민  남자  21   모름  210000

In [ ]:
# 열 삭제

     성별  나이    키
이름
허준호  남자  24  183
이가원  여자  23   모름
배규민  남자  21   모름

    이름  성별  나이    키
0  허준호  남자  24  183
1  이가원  여자  23   모름
2  배규민  남자  21   모름

In [ ]:
# 데이터 치환

# 성별이 남자일 때 1, 여자일 때 0으로 치환한 데이터프레임을 df2로 저장

C:\Users\SAMSUNG\AppData\Local\Temp\ipykernel_6628\3498396558.py:3: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df2 = df.replace(rep_cond)

    이름  성별  나이    키
0  허준호   1  24  183
1  이가원   0  23   모름
2  배규민   1  21   모름

In [ ]:
# 데이터프레임의 값 연산


# 성별 평균 키

# 성별 키의 표준편차

   성별        평균 키   키의 표준편차
0  남자  181.333333  2.081666
1  여자  160.500000  2.645751

# 6week

   0
0  1
1  2
2  3
3  4
4  5

In [ ]:
# 열 추가 :player => 'sonny','lee','kim','hwang','park'

   0 player
0  1  sonny
1  2    lee
2  3    kim
3  4  hwang
4  5   park

Index([0, 'player'], dtype='object')

In [ ]:
# 컬럽 이름 수정

   no player
0   1  sonny
1   2    lee
2   3    kim
3   4  hwang
4   5   park

In [ ]:

# 리스트 타입 형태이며, 데이터 값만 나온다.
# "리스트 안에 리스트가 있다." => 2차원 리스트

array([[1, 'sonny'],
       [2, 'lee'],
       [3, 'kim'],
       [4, 'hwang'],
       [5, 'park']], dtype=object)

In [ ]:
# 2차원 리스트 -> 데이터프레임
# 데이터가 여러개 있을 때는 list 형태로

[[7, 'sonny'], [10, 'lee'], [3, 'kim']]

In [ ]:
# list -> df으로 변환

# df 는 그저 변수명인것을 참고하라

    0      1
0   7  sonny
1  10    lee
2   3    kim

In [ ]:
# column 명 바꾸기

   no player
0   7  sonny
1  10    lee
2   3    kim

In [ ]:
# 딕셔너리 -> 데이터프레임

#딕셔너리 타입을 데이터프레임으로 { 키(열이름):value(데이터) }

{'name': ['sonny', 'kangin', 'minjae', 'channy'],
 'no': [7, 9, 3, 10],
 'age': [32, 23, 28, 28]}

     name  no  age
0   sonny   7   32
1  kangin   9   23
2  minjae   3   28
3  channy  10   28

In [ ]:
# 데이터프레임 크기

(4, 3)

In [ ]:
# 데이터프레임 처음 3행 출력

     name  no  age
0   sonny   7   32
1  kangin   9   23
2  minjae   3   28

In [ ]:
# 데이터프레임 끝 3행 출력

     name  no  age
1  kangin   9   23
2  minjae   3   28
3  channy  10   28

In [ ]:
# 데이터 속성 확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   no      4 non-null      int64
 2   age     4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [ ]:
# 데이터프레임 기술 통계

# 데이터 받으면 핸들링 하기전의 기본 자세
## shape -> head() or tail() -> info() -> describe()

              no        age
count   4.000000   4.000000
mean    7.250000  27.750000
std     3.095696   3.685557
min     3.000000  23.000000
25%     6.000000  26.750000
50%     8.000000  28.000000
75%     9.250000  29.000000
max    10.000000  32.000000

In [ ]:
# 열 추가

     name  no  age  weight
0   sonny   7   32      75
1  kangin   9   23      60
2  minjae   3   28      80
3  channy  10   28      80

     name  no  age  weight  height
0   sonny   7   32      75     180
1  kangin   9   23      60     171
2  minjae   3   28      80     190
3  channy  10   28      80     179

In [ ]:
# 특정 열 선택 출력

0     sonny
1    kangin
2    minjae
3    channy
Name: name, dtype: object

In [ ]:
# 특정 행 선택 출력

name      kangin
no             9
age           23
weight        60
height       171
Name: 1, dtype: object

In [ ]:
# exel 파일 받기
 # 'sheet_name =' 없이 적으면 첫번째 sheet 만 출력

    대중교통구분    노선명      년월   승차총승객수
0      지하철    1호선  201711  8633618
1      지하철    1호선  201712  8737235
2      지하철    1호선  201801  8145989
3      지하철    1호선  201802  7273309
4      지하철    1호선  201803  8692551
..     ...    ...     ...      ...
596    지하철  우이신설선  201901  1263643
597    지하철  우이신설선  201902  1102109
598    지하철  우이신설선  201903  1402393
599    지하철  우이신설선  201904  1403115
600    지하철  우이신설선  201905  1469681

[601 rows x 4 columns]

In [ ]:
# 데이터 프레임 크기

(601, 4)

In [ ]:
# 데이터프레임 데이터 앞 3개 출력

  대중교통구분  노선명      년월   승차총승객수
0    지하철  1호선  201711  8633618
1    지하철  1호선  201712  8737235
2    지하철  1호선  201801  8145989

In [ ]:
# 데이터프레임 데이터 뒤 3개 출력

    대중교통구분    노선명      년월   승차총승객수
598    지하철  우이신설선  201903  1402393
599    지하철  우이신설선  201904  1403115
600    지하철  우이신설선  201905  1469681

In [ ]:
# 특정 sheet 변경

   대중교통구분      년월     승차총승객수
0      버스  201711  163443126
1      버스  201712  162521011
2      버스  201801  153335185
3      버스  201802  134768582
4      버스  201803  166177855
5      버스  201804  160452595
6      버스  201805  164390595
7      버스  201806  156999747
8      버스  201807  163736112
9      버스  201808  160240197
10     버스  201809  151311657
11     버스  201810  165820934
12     버스  201811  163017758
13     버스  201812  158049446
14     버스  201901  153037549
15     버스  201902  131621925
16     버스  201903  161694445
17     버스  201904  161900273
18     버스  201905  166587933

    대중교통구분    노선명      년월   승차총승객수
0      지하철    1호선  201711  8633618
1      지하철    1호선  201712  8737235
2      지하철    1호선  201801  8145989
3      지하철    1호선  201802  7273309
4      지하철    1호선  201803  8692551
..     ...    ...     ...      ...
596    지하철  우이신설선  201901  1263643
597    지하철  우이신설선  201902  1102109
598    지하철  우이신설선  201903  1402393
599    지하철  우이신설선  201904  1403115
600    지하철  우이신설선  201905  1469681

[601 rows x 4 columns]

In [ ]:
# 특정 열 출력

0        1호선
1        1호선
2        1호선
3        1호선
4        1호선
       ...
596    우이신설선
597    우이신설선
598    우이신설선
599    우이신설선
600    우이신설선
Name: 노선명, Length: 601, dtype: object

In [ ]:
# 중복 제거 - 많은 데이터 중 중복을 제거

array(['1호선', '2호선', '3호선', '4호선', '경부선', '경인선', '경원선', '안산선', '과천선',
       '분당선', '일산선', '중앙선', '장항선', '경의선', '경춘선', '수인선', '경강선', '서해선',
       '5호선', '6호선', '7호선', '8호선', '인천1호선', '인천2호선', '9호선', '공항철도 1호선',
       '신분당선', '9호선2~3단계', '용인에버라인', '의정부경전철', '경기철도', '우이신설선'],
      dtype=object)

In [ ]:
# 특정 열, data 출력

10356250

10356250

In [ ]:
# loc 슬라이싱 (시작:끝)

  대중교통구분  노선명      년월   승차총승객수
0    지하철  1호선  201711  8633618
1    지하철  1호선  201712  8737235
2    지하철  1호선  201801  8145989
3    지하철  1호선  201802  7273309
4    지하철  1호선  201803  8692551
5    지하철  1호선  201804  8275767

In [ ]:
# 0~5번 행 슬라이싱 + 열은 '승차총승객수','대중교통구분'

    승차총승객수 대중교통구분
0  8633618    지하철
1  8737235    지하철
2  8145989    지하철
3  7273309    지하철
4  8692551    지하철
5  8275767    지하철

In [ ]:
# csv 파일 받아오기

# csv 파일은 한글을 지원하기 위해 인코딩 옵션을 주면 된다.

,책이름,저자,출판사,출간일,가격
0,Do it! 점프 투 파이썬,박응용,이지스퍼블리싱,2019년 06월,"16,920"
1,혼자 공부하는 머신러닝+딥러닝,박해선,한빛미디어,2020년 12월,"23,400"
2,혼자 공부하는 파이썬,윤인성,한빛미디어,2019년 06월,"16,200"
3,이것이 취업을 위한 코딩 테스트다 with 파이썬,나동빈,한빛미디어,2020년 08월,"30,600"
4,비전공자도 이해할 수 있는 AI 지식,박상길,반니,2022년 03월,"17,820"
...,...,...,...,...,...
739,스펙트럼 머신러닝 with 파이썬,장철원,비제이퍼블릭(BJ퍼블릭),2021년 12월,"64,350"
740,당신이 지금 알아야 할 클라우드 세트,이영호,비제이퍼블릭(BJ퍼블릭),2020년 10월,"142,200"
741,Step by Step 파이썬 비즈니스 통계분석,김형수,프레딕스,2021년 11월,"32,000"
742,머신러닝 알고리듬 트레이딩,스테판 젠슨,에이콘출판사,2021년 09월,"76,500"
743,머신러닝 알고리즘 트레이딩,세바스티앙 도나디오,에이콘출판사,0001년 01월,"70,200"

In [ ]:
# 데이터 크기

(744, 5)

In [ ]:
# 데이터 타입 정보

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 744 entries, 0 to 743
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   책이름     744 non-null    object
 1   저자      744 non-null    object
 2   출판사     744 non-null    object
 3   출간일     744 non-null    object
 4   가격      744 non-null    object
dtypes: object(5)
memory usage: 29.2+ KB

In [ ]:
# 중복 제거

array(['이지스퍼블리싱', '한빛미디어', '반니', '길벗', '앤써북', '책만', '생능출판사', '위키북스',
       '파이스탁', '정보문화사', '비제이퍼블릭(BJ퍼블릭)', '한빛아카데미', '생능북스', '에이콘출판사',
       '인포앤북', '골든래빗', '인피니티북스', '로드북', '제이펍', '영진닷컴', '터닝포인트', '오렌지미디어',
       '루비페이퍼', '시대고시기획 시대교육', '삼양미디어', '인사이트(insight)', '자유아카데미', '구미서관',
       'BOOKK(부크크)', '연두에디션', '복두출판사', '광문각', '잇플ITPLE', '삼일인포마인', '프리렉',
       '아이콕스(iCox)', '성안당', '씨마스', '홍릉과학출판사', '서울대학교출판문화원', '씨마스21',
       '코딩엑스', '햄큐(HAMQ)', '이한미디어', '부산대학교출판문화원', '디지털북스', '북스홀릭퍼블리싱',
       '동양북스(동양books)', '명진씨앤피', '가메출판사', 'REXmedia(렉스미디어)', '남가람북스',
       '아이씨뱅큐', '미리어드스페이스', '21세기사', '한양대학교출판부', '휴먼싸이언스', '오일러', '코딩타임',
       '가치랩스', '서현사', '늘봄', '책밥', '아티오', '홍릉', '심통', '지오북스', '한국정보인재개발원',
       '범', '시그마프레스', '씨아이알(CIR)', '교학사', '내하출판사', '정익사',
       '스토리조아(STORYJOA)', '좋은땅', '아이리포', '성진미디어', '코쿤아우트', '비팬북스(러닝스페이스)',
       '도수서원', '(주)코딩스쿨', '그린 (윤덕우)', '디스커버리미디어', 'AK(에이케이 커뮤니케이션즈)',
       '지오아카데미', '스포트라잇북', '그린', '글로벌', 'e비즈북스', '혜지원', '한티에듀', '인디라이프',
       '시대인', '에듀웨이', '카오스북', '(주)박영사', '와이북스', '다올미디어', '한나래', '일진사',
       '한경사', '원펀치', '기한재', '상학당', '앤아이컴즈', 'UUP', '플랜투비아이플러스',
       '부산대학교출판부(PNU Press)', '지앤선(志&嬋)', '경문사', '창조와지식', '크라운출판사',
       '지식과감성#', '영남대학교출판부(知YU智)', '노드미디어', '출판사Bogook(출판사보국)',
       '한성대학교출판부', '더코딩칼리지', '북스힐', '지란지교에듀랩', '에피스테메(방송대출판문화원)',
       '서울시립대학교출판부', '북랩', '고시고시', '구민사', '넥서스', '이모션미디어', '(유)캐멀컨설팅',
       '프레딕스'], dtype=object)

# 7week

In [1]:
# 매우 중요하다.
import pandas as pd

# excel 파일 받아오기
df_exl = pd.read_excel('C:/Users/SAMSUNG/Desktop/big_data_blog/middle_test/transportation.xlsx')
df_exl

    대중교통구분    노선명      년월   승차총승객수
0      지하철    1호선  201711  8633618
1      지하철    1호선  201712  8737235
2      지하철    1호선  201801  8145989
3      지하철    1호선  201802  7273309
4      지하철    1호선  201803  8692551
..     ...    ...     ...      ...
596    지하철  우이신설선  201901  1263643
597    지하철  우이신설선  201902  1102109
598    지하철  우이신설선  201903  1402393
599    지하철  우이신설선  201904  1403115
600    지하철  우이신설선  201905  1469681

[601 rows x 4 columns]

In [2]:
# 데이터 크기
df_exl.shape

(601, 4)

In [3]:
# 앞 5개 데이터 출력
df_exl.head()

  대중교통구분  노선명      년월   승차총승객수
0    지하철  1호선  201711  8633618
1    지하철  1호선  201712  8737235
2    지하철  1호선  201801  8145989
3    지하철  1호선  201802  7273309
4    지하철  1호선  201803  8692551

In [4]:
# 뒤 5개 데이터 출력
df_exl.tail()

    대중교통구분    노선명      년월   승차총승객수
596    지하철  우이신설선  201901  1263643
597    지하철  우이신설선  201902  1102109
598    지하철  우이신설선  201903  1402393
599    지하철  우이신설선  201904  1403115
600    지하철  우이신설선  201905  1469681

In [5]:
# 데이터 타입
df_exl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 601 entries, 0 to 600
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   대중교통구분  601 non-null    object
 1   노선명     601 non-null    object
 2   년월      601 non-null    int64
 3   승차총승객수  601 non-null    int64
dtypes: int64(2), object(2)
memory usage: 18.9+ KB

In [6]:
# 기술통계
df_exl.describe()

                  년월        승차총승객수
count     601.000000  6.010000e+02
mean   201822.419301  7.542217e+06
std        56.303380  9.225438e+06
min    201711.000000  3.437850e+05
25%    201803.000000  1.403115e+06
50%    201808.000000  3.537142e+06
75%    201901.000000  1.034604e+07
max    201905.000000  4.935649e+07

In [7]:
# 특정 열 출력 _ 노선명
df_exl['노선명']

0        1호선
1        1호선
2        1호선
3        1호선
4        1호선
       ...
596    우이신설선
597    우이신설선
598    우이신설선
599    우이신설선
600    우이신설선
Name: 노선명, Length: 601, dtype: object

In [9]:
# 중복 삭제 _ 노선명
unique_data_exl = df_exl['노선명'].unique()
unique_data_exl

array(['1호선', '2호선', '3호선', '4호선', '경부선', '경인선', '경원선', '안산선', '과천선',
       '분당선', '일산선', '중앙선', '장항선', '경의선', '경춘선', '수인선', '경강선', '서해선',
       '5호선', '6호선', '7호선', '8호선', '인천1호선', '인천2호선', '9호선', '공항철도 1호선',
       '신분당선', '9호선2~3단계', '용인에버라인', '의정부경전철', '경기철도', '우이신설선'],
      dtype=object)

In [ ]:
# 특정 행 출력 _ 100번
df.

# 행 이름과 index번호가 우연으로 일치해서지
# 원래 이름은 loc(ation), 숫자는 iloc

대중교통구분         지하철
노선명            경인선
년월          201804
승차총승객수    10356250
Name: 100, dtype: object

In [ ]:
# loc 이용해서 특정 행,열 출력

7876712

In [ ]:
# iloc 이용해서 특정 행,열 출력

7876712

In [ ]:
# loc 이용해서 10~12행, 노선명,승차총승객수 출력

# 두개 이상일때는 2차리스트[] 해줘야한다.

    노선명   승차총승객수
10  1호선  7876712
11  1호선  8783242
12  1호선  8692924

In [ ]:
# iloc 이용해서 10~12행, 노선명,승차총승객수 출력

    노선명   승차총승객수
10  1호선  7876712
11  1호선  8783242
12  1호선  8692924

In [ ]:
# csv 파일 받아오기

,책이름,저자,출판사,출간일,가격
0,Do it! 점프 투 파이썬,박응용,이지스퍼블리싱,2019년 06월,"16,920"
1,혼자 공부하는 머신러닝+딥러닝,박해선,한빛미디어,2020년 12월,"23,400"
2,혼자 공부하는 파이썬,윤인성,한빛미디어,2019년 06월,"16,200"
3,이것이 취업을 위한 코딩 테스트다 with 파이썬,나동빈,한빛미디어,2020년 08월,"30,600"
4,비전공자도 이해할 수 있는 AI 지식,박상길,반니,2022년 03월,"17,820"
...,...,...,...,...,...
739,스펙트럼 머신러닝 with 파이썬,장철원,비제이퍼블릭(BJ퍼블릭),2021년 12월,"64,350"
740,당신이 지금 알아야 할 클라우드 세트,이영호,비제이퍼블릭(BJ퍼블릭),2020년 10월,"142,200"
741,Step by Step 파이썬 비즈니스 통계분석,김형수,프레딕스,2021년 11월,"32,000"
742,머신러닝 알고리듬 트레이딩,스테판 젠슨,에이콘출판사,2021년 09월,"76,500"
743,머신러닝 알고리즘 트레이딩,세바스티앙 도나디오,에이콘출판사,0001년 01월,"70,200"

In [ ]:
# 데이터 크기

(744, 5)

In [ ]:
# 앞 5개 데이터 출력

                            책이름   저자      출판사        출간일      가격
0               Do it! 점프 투 파이썬  박응용  이지스퍼블리싱  2019년 06월  16,920
1              혼자 공부하는 머신러닝+딥러닝  박해선    한빛미디어  2020년 12월  23,400
2                   혼자 공부하는 파이썬  윤인성    한빛미디어  2019년 06월  16,200
3  이것이 취업을 위한 코딩 테스트다 with 파이썬   나동빈    한빛미디어  2020년 08월  30,600
4          비전공자도 이해할 수 있는 AI 지식  박상길       반니  2022년 03월  17,820

In [ ]:
# 뒤 5개 데이터 출력

                            책이름          저자            출판사        출간일       가격
739          스펙트럼 머신러닝 with 파이썬         장철원  비제이퍼블릭(BJ퍼블릭)  2021년 12월   64,350
740        당신이 지금 알아야 할 클라우드 세트         이영호  비제이퍼블릭(BJ퍼블릭)  2020년 10월  142,200
741  Step by Step 파이썬 비즈니스 통계분석         김형수           프레딕스  2021년 11월   32,000
742              머신러닝 알고리듬 트레이딩      스테판 젠슨         에이콘출판사  2021년 09월   76,500
743              머신러닝 알고리즘 트레이딩  세바스티앙 도나디오         에이콘출판사  0001년 01월   70,200

In [ ]:
# 데이터 타입

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 744 entries, 0 to 743
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   책이름     744 non-null    object
 1   저자      744 non-null    object
 2   출판사     744 non-null    object
 3   출간일     744 non-null    object
 4   가격      744 non-null    object
dtypes: object(5)
memory usage: 29.2+ KB

In [ ]:
# 기술 통계

              책이름   저자    출판사        출간일      가격
count         744  744    744        744     744
unique        720  607    130         93     103
top     파이썬 프로그래밍  천인국  한빛미디어  2022년 03월  27,000
freq            8    7    102         24      58

In [ ]:
# 중복 삭제 _ 출판사

array(['이지스퍼블리싱', '한빛미디어', '반니', '길벗', '앤써북', '책만', '생능출판사', '위키북스',
       '파이스탁', '정보문화사', '비제이퍼블릭(BJ퍼블릭)', '한빛아카데미', '생능북스', '에이콘출판사',
       '인포앤북', '골든래빗', '인피니티북스', '로드북', '제이펍', '영진닷컴', '터닝포인트', '오렌지미디어',
       '루비페이퍼', '시대고시기획 시대교육', '삼양미디어', '인사이트(insight)', '자유아카데미', '구미서관',
       'BOOKK(부크크)', '연두에디션', '복두출판사', '광문각', '잇플ITPLE', '삼일인포마인', '프리렉',
       '아이콕스(iCox)', '성안당', '씨마스', '홍릉과학출판사', '서울대학교출판문화원', '씨마스21',
       '코딩엑스', '햄큐(HAMQ)', '이한미디어', '부산대학교출판문화원', '디지털북스', '북스홀릭퍼블리싱',
       '동양북스(동양books)', '명진씨앤피', '가메출판사', 'REXmedia(렉스미디어)', '남가람북스',
       '아이씨뱅큐', '미리어드스페이스', '21세기사', '한양대학교출판부', '휴먼싸이언스', '오일러', '코딩타임',
       '가치랩스', '서현사', '늘봄', '책밥', '아티오', '홍릉', '심통', '지오북스', '한국정보인재개발원',
       '범', '시그마프레스', '씨아이알(CIR)', '교학사', '내하출판사', '정익사',
       '스토리조아(STORYJOA)', '좋은땅', '아이리포', '성진미디어', '코쿤아우트', '비팬북스(러닝스페이스)',
       '도수서원', '(주)코딩스쿨', '그린 (윤덕우)', '디스커버리미디어', 'AK(에이케이 커뮤니케이션즈)',
       '지오아카데미', '스포트라잇북', '그린', '글로벌', 'e비즈북스', '혜지원', '한티에듀', '인디라이프',
       '시대인', '에듀웨이', '카오스북', '(주)박영사', '와이북스', '다올미디어', '한나래', '일진사',
       '한경사', '원펀치', '기한재', '상학당', '앤아이컴즈', 'UUP', '플랜투비아이플러스',
       '부산대학교출판부(PNU Press)', '지앤선(志&嬋)', '경문사', '창조와지식', '크라운출판사',
       '지식과감성#', '영남대학교출판부(知YU智)', '노드미디어', '출판사Bogook(출판사보국)',
       '한성대학교출판부', '더코딩칼리지', '북스힐', '지란지교에듀랩', '에피스테메(방송대출판문화원)',
       '서울시립대학교출판부', '북랩', '고시고시', '구민사', '넥서스', '이모션미디어', '(유)캐멀컨설팅',
       '프레딕스'], dtype=object)

In [ ]:
# 데이터 수정

# 1. ',' 없애기 _ 가격에서

# 2. 문자형 -> 숫자형으로 변환

# 데이터 타입 확인

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 744 entries, 0 to 743
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   책이름     744 non-null    object
 1   저자      744 non-null    object
 2   출판사     744 non-null    object
 3   출간일     744 non-null    object
 4   가격      744 non-null    int32
dtypes: int32(1), object(4)
memory usage: 26.3+ KB

In [ ]:
# 기술 통계

                  가격
count     744.000000
mean    24828.521505
std      9581.718881
min      4500.000000
25%     19800.000000
50%     23875.000000
75%     28800.000000
max    142200.000000

In [ ]:
# 출간일 순으로 정렬 후 출력 _ sort_values

# 오름차순: True, 내림차순: False

                          책이름   저자       출판사        출간일     가격
724            처음 시작하는 파이썬 코딩  문병수  (유)캐멀컨설팅  2017년 07월  14400
545               파이썬 해킹프로그래밍  한상준    (주)박영사  2019년 03월  14000
483                   스타트 파이썬  황재호   (주)코딩스쿨  2018년 09월  17100
633  파이썬 터틀 그래픽을 이용한 프로그래밍 코딩  정민영     21세기사  2017년 09월  20000
614          파이썬을 이용한 빅데이터 분석  유성준     21세기사  2018년 10월  25000

In [ ]:
# 조건식 조회_ (10000 <= x <= 20000) 가격인 책 출력

                                    책이름      저자      출판사        출간일     가격
0                       Do it! 점프 투 파이썬     박응용  이지스퍼블리싱  2019년 06월  16920
2                           혼자 공부하는 파이썬     윤인성    한빛미디어  2019년 06월  16200
4                  비전공자도 이해할 수 있는 AI 지식     박상길       반니  2022년 03월  17820
6                   모두의 데이터 분석 with 파이썬     송석리       길벗  2019년 04월  16200
8                만들면서 배우는 파이썬과 40개의 작품들     장문철      앤써북  2022년 02월  16920
11                  Do it! 파이썬 생활 프로그래밍     김창현  이지스퍼블리싱  2020년 07월  18000
12  Do it! 자료구조와 함께 배우는 알고리즘 입문 : 파이썬 편  시바타 보요  이지스퍼블리싱  2020년 07월  19800
14                         Do it! 첫 파이썬  엘리스 코딩  이지스퍼블리싱  2020년 04월  12600
17     모두가 할 수 있는 앱 인벤터로 11개 인공지능 앱 만들기     박지숙      앤써북  2021년 06월  13050
18                              모두의 파이썬     이승찬       길벗  2018년 10월  10800

In [ ]:
# 특정 문자열 포함하는 문자열 데이터 조회 _ 파이썬

                                  책이름   저자            출판사        출간일     가격
0                     Do it! 점프 투 파이썬  박응용        이지스퍼블리싱  2019년 06월  16920
2                         혼자 공부하는 파이썬  윤인성          한빛미디어  2019년 06월  16200
3        이것이 취업을 위한 코딩 테스트다 with 파이썬   나동빈          한빛미디어  2020년 08월  30600
6                 모두의 데이터 분석 with 파이썬  송석리             길벗  2019년 04월  16200
8              만들면서 배우는 파이썬과 40개의 작품들  장문철            앤써북  2022년 02월  16920
..                                ...  ...            ...        ...    ...
736                   실전 파이썬 핸즈온 프로젝트  리 본             책만  2022년 05월  25200
737  Do it! 점프 투 파이썬 + 파이썬 라이브러리 예제 편  박응용        이지스퍼블리싱  2022년 05월  40320
738                         파이썬 프로그래밍  손승일          21세기사  2022년 01월  30000
739                스펙트럼 머신러닝 with 파이썬  장철원  비제이퍼블릭(BJ퍼블릭)  2021년 12월  64350
741        Step by Step 파이썬 비즈니스 통계분석  김형수           프레딕스  2021년 11월  32000

[502 rows x 5 columns]

In [ ]:
# 열 생성 _ ['할인가'] => 가격 * 0.9

                            책이름   저자      출판사        출간일     가격      할인가
0               Do it! 점프 투 파이썬  박응용  이지스퍼블리싱  2019년 06월  16920  15228.0
1              혼자 공부하는 머신러닝+딥러닝  박해선    한빛미디어  2020년 12월  23400  21060.0
2                   혼자 공부하는 파이썬  윤인성    한빛미디어  2019년 06월  16200  14580.0
3  이것이 취업을 위한 코딩 테스트다 with 파이썬   나동빈    한빛미디어  2020년 08월  30600  27540.0
4          비전공자도 이해할 수 있는 AI 지식  박상길       반니  2022년 03월  17820  16038.0

In [ ]:
# 열 삭제 _ 할인가

                            책이름   저자      출판사        출간일     가격
0               Do it! 점프 투 파이썬  박응용  이지스퍼블리싱  2019년 06월  16920
1              혼자 공부하는 머신러닝+딥러닝  박해선    한빛미디어  2020년 12월  23400
2                   혼자 공부하는 파이썬  윤인성    한빛미디어  2019년 06월  16200
3  이것이 취업을 위한 코딩 테스트다 with 파이썬   나동빈    한빛미디어  2020년 08월  30600
4          비전공자도 이해할 수 있는 AI 지식  박상길       반니  2022년 03월  17820

# 8week

In [13]:
import pandas as pd
# csv 파일 불러오기
df_csv=pd.read_csv('C:/Users/SAMSUNG/Desktop/big_data_blog/middle_test/pythonBook.csv',sep=',',encoding='cp949')
df_csv

,책이름,저자,출판사,출간일,가격
0,Do it! 점프 투 파이썬,박응용,이지스퍼블리싱,2019년 06월,"16,920"
1,혼자 공부하는 머신러닝+딥러닝,박해선,한빛미디어,2020년 12월,"23,400"
2,혼자 공부하는 파이썬,윤인성,한빛미디어,2019년 06월,"16,200"
3,이것이 취업을 위한 코딩 테스트다 with 파이썬,나동빈,한빛미디어,2020년 08월,"30,600"
4,비전공자도 이해할 수 있는 AI 지식,박상길,반니,2022년 03월,"17,820"
...,...,...,...,...,...
739,스펙트럼 머신러닝 with 파이썬,장철원,비제이퍼블릭(BJ퍼블릭),2021년 12월,"64,350"
740,당신이 지금 알아야 할 클라우드 세트,이영호,비제이퍼블릭(BJ퍼블릭),2020년 10월,"142,200"
741,Step by Step 파이썬 비즈니스 통계분석,김형수,프레딕스,2021년 11월,"32,000"
742,머신러닝 알고리듬 트레이딩,스테판 젠슨,에이콘출판사,2021년 09월,"76,500"
743,머신러닝 알고리즘 트레이딩,세바스티앙 도나디오,에이콘출판사,0001년 01월,"70,200"

In [5]:
# 파일 크기 확인
df_csv.shape

(744, 5)

In [6]:
# 데이터 타입 확인
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 744 entries, 0 to 743
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   책이름     744 non-null    object
 1   저자      744 non-null    object
 2   출판사     744 non-null    object
 3   출간일     744 non-null    object
 4   가격      744 non-null    object
dtypes: object(5)
memory usage: 29.2+ KB

In [ ]:
# 앞 데이터 확인

                            책이름   저자      출판사        출간일      가격
0               Do it! 점프 투 파이썬  박응용  이지스퍼블리싱  2019년 06월  16,920
1              혼자 공부하는 머신러닝+딥러닝  박해선    한빛미디어  2020년 12월  23,400
2                   혼자 공부하는 파이썬  윤인성    한빛미디어  2019년 06월  16,200
3  이것이 취업을 위한 코딩 테스트다 with 파이썬   나동빈    한빛미디어  2020년 08월  30,600
4          비전공자도 이해할 수 있는 AI 지식  박상길       반니  2022년 03월  17,820

In [ ]:
# 뒤 데이터 확인

                            책이름          저자            출판사        출간일       가격
739          스펙트럼 머신러닝 with 파이썬         장철원  비제이퍼블릭(BJ퍼블릭)  2021년 12월   64,350
740        당신이 지금 알아야 할 클라우드 세트         이영호  비제이퍼블릭(BJ퍼블릭)  2020년 10월  142,200
741  Step by Step 파이썬 비즈니스 통계분석         김형수           프레딕스  2021년 11월   32,000
742              머신러닝 알고리듬 트레이딩      스테판 젠슨         에이콘출판사  2021년 09월   76,500
743              머신러닝 알고리즘 트레이딩  세바스티앙 도나디오         에이콘출판사  0001년 01월   70,200

In [8]:
# 데이터 수정
# ',' -> ''  가격에 , 없애기
df_csv['가격']=df_csv['가격'].str.replace(',','')
# 문자형 -> 숫자형
df_csv['가격']=df_csv['가격'].astype(int)
# 데이터 타입 확인
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 744 entries, 0 to 743
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   책이름     744 non-null    object
 1   저자      744 non-null    object
 2   출판사     744 non-null    object
 3   출간일     744 non-null    object
 4   가격      744 non-null    int32
dtypes: int32(1), object(4)
memory usage: 26.3+ KB

In [9]:
# 기술통계
df_csv.describe()

                  가격
count     744.000000
mean    24828.521505
std      9581.718881
min      4500.000000
25%     19800.000000
50%     23875.000000
75%     28800.000000
max    142200.000000

In [10]:
# '출판일' 순으로 내림차순 정렬

df_csv.sort_values(by='출간일',ascending=False).head()

,책이름,저자,출판사,출간일,가격
106,파이썬 한권으로 끝내기,데싸라면,시대고시기획 시대교육,2022년 06월,24300
323,혼자 공부하는 파이썬,윤인성,한빛미디어,2022년 06월,19800
246,백엔드를 위한 Django REST Framework with 파이썬,권태형,영진닷컴,2022년 05월,16200
736,실전 파이썬 핸즈온 프로젝트,리 본,책만,2022년 05월,25200
737,Do it! 점프 투 파이썬 + 파이썬 라이브러리 예제 편,박응용,이지스퍼블리싱,2022년 05월,40320

In [11]:
# 정렬 항목이 2개 이상이면 리스트[] 사용 + '출판사'는 오름,'출간일'은 내림
df_csv.sort_values(by=['출판사','출간일'],ascending=[True,False]).head()

                책이름   저자       출판사        출간일     가격
724  처음 시작하는 파이썬 코딩  문병수  (유)캐멀컨설팅  2017년 07월  14400
545     파이썬 해킹프로그래밍  한상준    (주)박영사  2019년 03월  14000
483         스타트 파이썬  황재호   (주)코딩스쿨  2018년 09월  17100
738       파이썬 프로그래밍  손승일     21세기사  2022년 01월  30000
328   파이썬으로 코딩하는 물리  송오영     21세기사  2021년 03월  29000

In [12]:
# 조건식 조회 _ (10000 <= x <= 20000) 가격인 책 출력
df_csv[(df_csv['가격']>=10000)&(df_csv['가격']<=20000)]

,책이름,저자,출판사,출간일,가격
0,Do it! 점프 투 파이썬,박응용,이지스퍼블리싱,2019년 06월,16920
2,혼자 공부하는 파이썬,윤인성,한빛미디어,2019년 06월,16200
4,비전공자도 이해할 수 있는 AI 지식,박상길,반니,2022년 03월,17820
6,모두의 데이터 분석 with 파이썬,송석리,길벗,2019년 04월,16200
8,만들면서 배우는 파이썬과 40개의 작품들,장문철,앤써북,2022년 02월,16920
...,...,...,...,...,...
712,유튜버 주간컴공 지마&참깨의 프리패스 파이썬,지마,고시고시,2020년 09월,16200
718,코딩으로 지구정복,코인 : 코딩하는 사람들,넥서스,2019년 03월,12420
721,25시간만에 배우는 머신러닝 예제 : 파이썬 활용,김준석,이모션미디어,2018년 01월,15000
724,처음 시작하는 파이썬 코딩,문병수,(유)캐멀컨설팅,2017년 07월,14400
731,실전 파이썬 프로그래밍,줄리안 단주,인사이트(insight),2014년 12월,15300

In [ ]:
# 특정 문자열 포함하는 문자열 데이터 조회 _ '파이썬'

                                  책이름   저자            출판사        출간일     가격
0                     Do it! 점프 투 파이썬  박응용        이지스퍼블리싱  2019년 06월  16920
2                         혼자 공부하는 파이썬  윤인성          한빛미디어  2019년 06월  16200
3        이것이 취업을 위한 코딩 테스트다 with 파이썬   나동빈          한빛미디어  2020년 08월  30600
6                 모두의 데이터 분석 with 파이썬  송석리             길벗  2019년 04월  16200
8              만들면서 배우는 파이썬과 40개의 작품들  장문철            앤써북  2022년 02월  16920
..                                ...  ...            ...        ...    ...
736                   실전 파이썬 핸즈온 프로젝트  리 본             책만  2022년 05월  25200
737  Do it! 점프 투 파이썬 + 파이썬 라이브러리 예제 편  박응용        이지스퍼블리싱  2022년 05월  40320
738                         파이썬 프로그래밍  손승일          21세기사  2022년 01월  30000
739                스펙트럼 머신러닝 with 파이썬  장철원  비제이퍼블릭(BJ퍼블릭)  2021년 12월  64350
741        Step by Step 파이썬 비즈니스 통계분석  김형수           프레딕스  2021년 11월  32000

[502 rows x 5 columns]

In [ ]:
# 열 생성 _ ['할인가'] => 가격 * 0.9

                            책이름   저자      출판사        출간일     가격      할인가
0               Do it! 점프 투 파이썬  박응용  이지스퍼블리싱  2019년 06월  16920  15228.0
1              혼자 공부하는 머신러닝+딥러닝  박해선    한빛미디어  2020년 12월  23400  21060.0
2                   혼자 공부하는 파이썬  윤인성    한빛미디어  2019년 06월  16200  14580.0
3  이것이 취업을 위한 코딩 테스트다 with 파이썬   나동빈    한빛미디어  2020년 08월  30600  27540.0
4          비전공자도 이해할 수 있는 AI 지식  박상길       반니  2022년 03월  17820  16038.0

In [ ]:
# 열 삭제 _ 할인가

                            책이름   저자      출판사        출간일     가격
0               Do it! 점프 투 파이썬  박응용  이지스퍼블리싱  2019년 06월  16920
1              혼자 공부하는 머신러닝+딥러닝  박해선    한빛미디어  2020년 12월  23400
2                   혼자 공부하는 파이썬  윤인성    한빛미디어  2019년 06월  16200
3  이것이 취업을 위한 코딩 테스트다 with 파이썬   나동빈    한빛미디어  2020년 08월  30600
4          비전공자도 이해할 수 있는 AI 지식  박상길       반니  2022년 03월  17820

In [ ]:
# 집계함수
# groupby() : 옵션 => 1. by => 집게할 항목, 2. 집계함수 => min(), max(), mean(), count()

# 출판사별 서적 의 최대가격 (제일 비싼가격)

출판사
(유)캐멀컨설팅            14400
(주)박영사              14000
(주)코딩스쿨             17100
21세기사               30000
AK(에이케이 커뮤니케이션즈)    23750
                    ...
햄큐(HAMQ)            18000
혜지원                 24300
홍릉                  37000
홍릉과학출판사             39000
휴먼싸이언스              25000
Name: 가격, Length: 130, dtype: int32

In [ ]:
# 리스트 만들어서 데이터프레임 생성해. 열 이름은 'name','team','age','weight'이야

     name team  age  weight
0   sonny  tot   32      75
1  channy  wol   28      80
2     lee  psg   23      60

In [ ]:
# 행 추가
# df.loc[3]=['kim', np.nan, 28, 90] # 회사가서나 과제할떄 이렇게 하면 감점받음 -> hard coding
# df

# # 행의 갯수를 세우면 알아서 마지막 행 -> len
# np.nan : 값을 모를때 null 값 추가

     name team   age  weight
0   sonny  tot  32.0    75.0
1  channy  wol  28.0    80.0
2     lee  psg  23.0    60.0
3     kim  NaN  28.0    90.0
4    park   bm   NaN    90.0
5   hwang   jm  28.0     NaN

In [ ]:
# df 데이터타입 확인

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   team    5 non-null      object
 2   age     5 non-null      float64
 3   weight  5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 240.0+ bytes

In [ ]:
# null 값 유무 확인 isna _ null -> True

    name   team    age  weight
0  False  False  False   False
1  False  False  False   False
2  False  False  False   False
3  False   True  False   False
4  False  False   True   False
5  False  False  False    True

In [ ]:
# isna와 반대로 출력하여 확인 notna _ null -> False

   name   team    age  weight
0  True   True   True    True
1  True   True   True    True
2  True   True   True    True
3  True  False   True    True
4  True   True  False    True
5  True   True   True   False

In [ ]:
# age 컬럼의 값이 nan인 포함된 행만 삭제 - dropna

     name team   age  weight
0   sonny  tot  32.0    75.0
1  channy  wol  28.0    80.0
2     lee  psg  23.0    60.0
3     kim  NaN  28.0    90.0
5   hwang   jm  28.0     NaN

In [ ]:
# null값에 특정 문자 채워주고 싶다. -> fillna

     name team   age  weight
0   sonny  tot  32.0    75.0
1  channy  wol  28.0    80.0
2     lee  psg  23.0    60.0
3     kim    0  28.0    90.0
4    park   bm   0.0    90.0
5   hwang   jm  28.0     0.0

In [ ]:
# 리스트 컴프리헨션
# var = [2,4,6,8,10,12,14,16,18,20,22,24,26,28,30]

[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30]

In [ ]:
# null 값 있는 열들 갯수 출력 sum()

name      0
team      1
age       1
weight    1
dtype: int64